report/report.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.0 r1840935">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="TestCase" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Chart" enabled="false">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">form_data: {&quot;datasource&quot;:&quot;1__kylin&quot;,&quot;viz_type&quot;:&quot;table&quot;,&quot;slice_id&quot;:2,&quot;granularity_sqla&quot;:&quot;V_GITHUB_MODEL.REPOS_CREATED&quot;,&quot;time_grain_sqla&quot;:null,&quot;since&quot;:&quot;&quot;,&quot;until&quot;:&quot;&quot;,&quot;groupby&quot;:[&quot;V_GITHUB_MODEL.REPOS_NAME&quot;,&quot;V_GITHUB_MODEL.REPOS_LANGUAGE&quot;,&quot;V_GITHUB_MODEL.REPOS_LICENSE&quot;,&quot;V_GITHUB_MODEL.REPOS_CREATED&quot;,&quot;V_GITHUB_MODEL.REPOS_MODIFIED&quot;,&quot;V_GITHUB_MODEL.USERS_LOGIN&quot;,&quot;V_GITHUB_MODEL.USERS_COMPANY&quot;,&quot;V_GITHUB_MODEL.USER_TYPE&quot;,&quot;V_GITHUB_MODEL.USER_CREATED&quot;,&quot;V_GITHUB_MODEL.USER_MODIFIED&quot;],&quot;metrics&quot;:[&quot;_COUNT_&quot;,&quot;REPOS_STARS&quot;,&quot;REPOS_FORKS&quot;,&quot;USERS_FOLLOWERS&quot;,&quot;SUM_REPOS_ACTIVE_YEAR&quot;],&quot;timeseries_limit_metric&quot;:null,&quot;row_limit&quot;:100,&quot;include_time&quot;:false,&quot;order_desc&quot;:true,&quot;all_columns&quot;:[],&quot;order_by_cols&quot;:[],&quot;table_timestamp_format&quot;:&quot;%Y-%m-%d %H:%M:%S&quot;,&quot;page_length&quot;:0,&quot;include_search&quot;:false,&quot;table_filter&quot;:false,&quot;align_pn&quot;:false,&quot;color_pn&quot;:true,&quot;where&quot;:&quot;&quot;,&quot;having&quot;:&quot;&quot;,&quot;filters&quot;:[],&quot;url_params&quot;:{},&quot;extra_filters&quot;:[]}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">10.1.0.248</stringProp>
          <stringProp name="HTTPSampler.port">8099</stringProp>
          <stringProp name="HTTPSampler.path">/superset/explore_json/?form_data=%7B%22slice_id%22%3A1%7D</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/x-www-form-urlencoded; charset=UTF-8</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="HTTP Cookie Manager" enabled="true">
            <collectionProp name="CookieManager.cookies">
              <elementProp name="session" elementType="Cookie" testname="session">
                <stringProp name="Cookie.value">.eJx1z91qxCAQhuF7meMQNTHrz62UEkYdm7BuDGpaltJ7r1B6UujhwPe8MJ-wxkJ1A9vKRQOsewAL2uFNTlNYvCKOPgqzTBiDcIQz90ZCH55UHnjQ0X6pryWuLd_p6IXgtUKtFNcyqoXPnhNX0U_eLWGWN2Uw9NPxXkrZY6JuOhzgxDdat722XJ5gX2Br7bSMCT6KkY-T1FZzY1jAurmMJTxyoPS-0wdLHbFe-Efcn2k_Ajas-Sqe_rrXAa5K5ed_AV_f699YEw.W9KKWg.XVxKkrtwvAmlqQXwNtVez4qVbhk</stringProp>
                <stringProp name="Cookie.domain">10.1.0.248</stringProp>
                <stringProp name="Cookie.path">/</stringProp>
                <boolProp name="Cookie.secure">false</boolProp>
                <longProp name="Cookie.expires">0</longProp>
                <boolProp name="Cookie.path_specified">true</boolProp>
                <boolProp name="Cookie.domain_specified">true</boolProp>
              </elementProp>
            </collectionProp>
            <boolProp name="CookieManager.clearEachIteration">false</boolProp>
          </CookieManager>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Login" enabled="false">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">csrf_token=ImVjMTgyMmQ4NGI5YThlZjE0MTFhYTgxNjM0Y2ZlNjRhYTY3YmM0YzAi.DqhByg.OcToVKT7485nmTkPfEynokNOW78&amp;username=yu.quan&amp;password=admin</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">10.1.0.248</stringProp>
          <stringProp name="HTTPSampler.port">8099</stringProp>
          <stringProp name="HTTPSampler.path">/login</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/x-www-form-urlencoded; charset=UTF-8</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="HTTP Cookie Manager" enabled="true">
            <collectionProp name="CookieManager.cookies">
              <elementProp name="session" elementType="Cookie" testname="session">
                <stringProp name="Cookie.value">session=.eJw9zbEOgjAUheFXMXdmIE1cSBhMKoShEEyx6V0IQrVACwYxioR3t3FwPP_wnRXKtoFghd0FApC82DPeaOS5jzTxUcjFNcJE_sIYe0ZSIzutpZUhbB6UdzXZalDDDME8PZUH9WO6lvPYq-GPomDvjCYL0psvO6Oz-GwZz99MRDqjR8I-pw5tQdI40mnXtNJtdgh_B2asK6Mc4rztC9R_ODg.DqhByg.6Pua_Dfh1pb5KsURmsJsTa-ssYs</stringProp>
                <stringProp name="Cookie.domain">10.1.2.224</stringProp>
                <stringProp name="Cookie.path">/</stringProp>
                <boolProp name="Cookie.secure">false</boolProp>
                <longProp name="Cookie.expires">0</longProp>
                <boolProp name="Cookie.path_specified">true</boolProp>
                <boolProp name="Cookie.domain_specified">true</boolProp>
              </elementProp>
            </collectionProp>
            <boolProp name="CookieManager.clearEachIteration">false</boolProp>
          </CookieManager>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="SQLLab" enabled="false">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">10.1.0.248</stringProp>
          <stringProp name="HTTPSampler.port">8099</stringProp>
          <stringProp name="HTTPSampler.path">/superset/sqllab</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Cookie</stringProp>
                <stringProp name="Header.value">session=.eJy10UFqxDAMBdC7aB1ix0nGjq9SSlAsuQnjiYPttAzD3L2G0l0L3XQp-O8LoQfMPnFewZZ0cgPzRmDBLHgZlKLRaZbofDeNCj11C2Mv3TRADR6cbrjzXr6py8nPJV55rw3kjEajtTSD16PsnWSpvVNuGakfLnpCquMia1OIDgNXU2EDB77xvG65xHQH-wJrKYcVopNt18pWDcYaOU0ih83xLRKH940_RKhAVP1LmjCvS8REfxbXe9h2woI5nulfN_14yWsDZ-b09Y0Onp89IoNs.W9LiAQ.FTS-3kWRAKLc2T-y2zi3cjbRF7s</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Explore" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">10.1.0.248</stringProp>
          <stringProp name="HTTPSampler.port">8099</stringProp>
          <stringProp name="HTTPSampler.path">/superset/explore/kylin/1/</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Cookie</stringProp>
                <stringProp name="Header.value">session=.eJy10UFqxDAMBdC7aB1ix0nGjq9SSlAsuQnjiYPttAzD3L2G0l0L3XQp-O8LoQfMPnFewZZ0cgPzRmDBLHgZlKLRaZbofDeNCj11C2Mv3TRADR6cbrjzXr6py8nPJV55rw3kjEajtTSD16PsnWSpvVNuGakfLnpCquMia1OIDgNXU2EDB77xvG65xHQH-wJrKYcVopNt18pWDcYaOU0ih83xLRKH940_RKhAVP1LmjCvS8REfxbXe9h2woI5nulfN_14yWsDZ-b09Y0Onp89IoNs.W9LiAQ.FTS-3kWRAKLc2T-y2zi3cjbRF7s</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="false">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">200</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Kylin Query" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;project&quot;: &quot;github&quot;, &quot;sql&quot;: &quot;select count(*) from github&quot;, &quot;limit&quot;: 50000, &quot;acceptPartial&quot;: false, &quot;offset&quot;: 0}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">10.1.2.23</stringProp>
          <stringProp name="HTTPSampler.port">7070</stringProp>
          <stringProp name="HTTPSampler.path">/kylin/api/query</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Basic QURNSU46S1lMSU5AMTIz</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>